Revit 2027 API
BuiltInFailures.GeneralFailures.GenericCorruption Property
 A generic error has occurred.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GenericCorruption { get; }
Public Shared ReadOnly Property GenericCorruption As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GenericCorruption {
	FailureDefinitionId^ get ();
}
static member GenericCorruption : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace